---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
source: html/1f7aba9b-24ce-547e-8143-e31078e117fc.htm
---
# InitialLuminousIntensity Members

Creates an initial luminous intensity object with the given document and luminosity values.